# GetUnscaledTransformWithoutFixOfDirection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetUnscaledTransformWithoutFixOfDirection Method
ExporterIFCUtils Class See Also
---
Obtains the unscaled transform from an IfcLocalPlacement handle without fix of direction.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static Transform GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC exporterIFC,
	IFCAnyHandle placement
)
```

Visual Basic
---
```text
Public Shared Function GetUnscaledTransformWithoutFixOfDirection ( _
	exporterIFC As ExporterIFC, _
	placement As IFCAnyHandle _
) As Transform
```

Visual C++
---
```text
public:
static Transform^ GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ placement
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
placement
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The placement handle.
# ### Return Value
The transform.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace